app/Http/Controllers/CustomerController.php

    public function index()
    {
        $customers = Customer::all();
---
select * from `customers`

    public function store(Request $request)
    {
        $customer = new Customer();
        $customer->fill($request->all());
        $customer->save();
---
insert into `customers` (`name`, `email`, `zipcode`, `address`, `phone`, `updated_at`, `created_at`) values ('name', 'email@email.com', '0283318', '紫波郡紫波町紫波中央駅前', '0125-23-1524', '2021-09-26 16:03:21', '2021-09-26 16:03:21')

    public function update(Request $request, Customer $customer)
    {
        $customer->fill($request->all());
        $customer->save();
---
update `customers` set `name` = 'namedd', `customers`.`updated_at` = '2021-09-26 16:04:44' where `id` = 11

    public function destroy(Customer $customer)
    {
        $customer->delete();
---
delete from `customers` where `id` = 1